app/controllers/messages_controller.rb

SELECT "messages".* FROM "messages"
SELECT "users".* FROM "users"
---
  def index
    @messages = Message.all
    @message = current_user.messages.new
    @users = User.all

INSERT INTO "messages" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "ㅎ2"], ["user_id", 2], ["created_at", 2017-04-07 09:14:50 UTC], ["updated_at", 2017-04-07 09:14:50 UTC]]
---
  def create
    @message = Message.new(message_params)
    @message.user = current_user

    respond_to do |format|
      if @message.save